# Brewfile for PHP/Laravel & Node.js Development
# Install with: brew bundle

# ============================================================================
# Essential CLI Tools
# ============================================================================

brew "git"
brew "gh"                    # GitHub CLI
brew "wget"
brew "tree"

# ============================================================================
# PHP & Laravel Development
# ============================================================================

brew "php"
brew "composer"
cask "herd"                  # Laravel development environment

# ============================================================================
# Node.js Development
# ============================================================================

brew "node"
brew "yarn"

# ============================================================================
# Databases
# ============================================================================

brew "mysql"
brew "redis"

# ============================================================================
# Useful CLI Utilities
# ============================================================================

brew "fzf"                   # Fuzzy file finder
brew "ripgrep"               # Fast search (better than grep)
brew "mas"                   # Mac App Store CLI

# ============================================================================
# Applications
# ============================================================================

# Development
cask "visual-studio-code"
cask "claude-code"           # AI coding assistant CLI
cask "postman"               # API testing

# Database management
cask "tableplus"             # Database GUI

# Browsers
cask "google-chrome"
#cask "firefox"

# Productivity
#cask "rectangle"             # Window management (free, simple)
cask "notion"                 # Notes and project management
cask "bitwarden"              # Password manager

# Optional: Uncomment if needed
# cask "slack"
# cask "docker"

# ============================================================================
# Mac App Store Apps
# ============================================================================
# Install with: mas install <id>
# Find app IDs with: mas search "app name"

# Productivity (uncomment the ones you want)
# mas "Magnet", id: 441258766           # Window manager ($7.99)
# mas "Things", id: 904280696           # Task manager
# mas "1Password", id: 1333542190       # Password manager

# Utilities
# mas "Amphetamine", id: 937984704      # Keep Mac awake (free)
# mas "The Unarchiver", id: 425424353   # Archive extraction (free)

# Apple Apps (free)
# mas "Keynote", id: 409183694
 mas "Numbers", id: 409203825
 mas "Pages", id: 409201541
# mas "Xcode", id: 497799835            # iOS/macOS development
